import React from 'react';
import Course from '../Course/Course';
import './Aboute.css'

const Aboute = () => {
    const AddCourse = [{
        CourseName: 'Web Design',
        detail:`ওয়েব ডিজাইন হচ্ছে একটি ওয়েব পেজ বা একটি ওয়েবসাইট ডিজাইন করা। ওয়েবসাইট টা দেখতে কেমন হবে। সেটার কালার কেমন হবে। কোন অংশটা কোথায় থাকবে । এইটা নিজের পছন্দমত করতে পারাটাই হচ্ছে ওয়েব ডিজাইন। আমরা অনেক অনেক ওয়েবসাইট ব্রাউজ করি। প্রত্যেকটা ওয়েবসাইট কিন্তু দেখতে একই রকম হয় না। একটা দেখতে একরকম হয় ‌অন্যটা দেখতে অন্যরকম হয়। এর কারণ হচ্ছে দুইটা ওয়েবসাইটের ডিজাইন একই না। কারণ যে যে ডিজাইনার ওয়েবসাইট দুইটা কে ডিজাইন করেছেন তারা ভিন্ন ভাবে ডিজাইন করেছেন। কেউ কাউকে অনুকরণ করেন নি বা দেখেননি।এখন আপনাদের মনে হতে পারে তাহলে কিভাবে শিখতে পারি এটা?য়েব ডিজাইন করতে হলে আমাদের কিছু কিছু ল্যাঙ্গুয়েজ শিখতে হয়। সেগুলোর ভেতরে অন্যতম রয়েছে এইচটিএমএল, সিএসএস এবং জাভাস্ক্রিপ্ট। এছাড়া আরো অনেক অনেক ল্যাঙ্গুয়েজ রয়েছে। যেগুলো দিয়ে ওয়েব ডিজাইন করা যায়। তবে এই তিনটি ল্যাঙ্গুয়েজ দিয়ে ডিজাইন করা টা অনেক সহজ বলে আমি মনে করি।ওয়েব ডিজাইন করতে হলে যে যে রিকোয়ারমেন্ট প্রয়োজন তা হলো

        ১। একটি কম্পিউটার বা ল্যাপ্টপ

        ২। একটি ইন্টারনেট কানেকশন।

    কম্পিউটার না থাকলে আপনার কাছে যদি ৫ ইঞ্চি বা তার থেকে বড়  ডিসপ্লের একটি মোবাইল থাকে তবুও আপনি ওয়েব ডিজাইন শিখতে পারবেন এবং প্র্যাকটিস করতে পারবেন। বিশ্বাস হচ্ছে না? এখন বলি এটা কিভাবে করবেন- একটি মাল্টিপল পোলের ওটিজি ক্যাবল নিবেন। একটি মাউস এবং একটি কিবোর্ড ওটিজি ক্যাবলের সাথে সংযুক্ত করবেন এবং মোবাইলটাকে ল্যান্ডস্কেপ অর্থাৎ কাত করে রেখে কোন এডিটর হিসেবে একটি  অ্যানড্রয়েড অ্যাপস ইনস্টল করে  তার ভেতরে লিখে লিখে প্র্যাকটিস করতে পারবেন। যদি মাল্টিপল ফোনের ওটিজি না পান সে ক্ষেত্রে একটি ওটিজি দিয়ে কিবোর্ড কানেক্ট করবেন এবং মাউসের কাজ টা আঙ্গুল দিয়ে টাচ করে তারপরে করবেন। এভাবে বেসিক লেভেল টা প্র্যাকটিস করতে পারবেন। পরবর্তীতে সময়-সুযোগ করে একটি ডেস্কটপ কম্পিউটার বা ল্যাপ্টপ নিয়ে নিবেন। তবে কম্পিউটার না থাকলে যে ওয়েব ডিজাইন শিখতে পারবেন না ব্যাপারটা এমন না। বর্তমান সময়ে কিন্তু কেউ বসে নাই। এখন আমরা যদি কম্পিউটার না থাকার কারণে থেমে থাকি তাহলে কিন্তু অনেক পেছনে পড়ে যেতে হবে। আমি আপনাদের কে রিকমেন্ড করব যে কম্পিউটারের জন্য আপনারা বসে থাকবেন না। সামনের পৃথিবীটা অনেক অনেক প্রতিযোগিতার। তাই যে যত কম সময়ে অনেক অনেক বেশি স্কিল অর্জন করতে পারবে তার ভবিষ্যৎ টা তত সহজ হবে।
    ওয়েব ডিজাইন শেখার জন্য কোন নির্দিষ্ট বয়স নাই। কারণ এটা লজিক্যাল প্রোগ্রামিং না। এখানে প্রথমদিকে ক্রিয়েটিভিটির তেমন কিছু নাই। প্রাকটিস করতে করতে অনেক কিছু শিখে নিয়ে পারবেন। এমনকি একটা পর্যায়ে মুখস্থ হয়ে যায়। হ্যাঁ তবে যখন একটু প্রফেশনাল লেভেলে চলে যাবেন তখন ডিজাইনের সৌন্দর্য ইউনিক করার জন্য কিছুটা ক্রিয়েটিভিটির প্রয়োজন হয়। সেটা অনেক পরের ব্যাপার। আজকে এই পর্যন্ত। আগামী পর্বের আমন্ত্রণ জানিয়ে আজ এখানেই শেষ করছি `,
        image: 'https://i.ibb.co/c1SVkk2/1234.jpg',
        priceName: 'Course fee',
        curenci:'BD',
        Price:9000
    },

        {
        CourseName: 'Web Devlopment',
        detail:`ওয়েব ডেভেলপার হতে 
        চাইলেফ্রিল্যান্স মার্কেটপ্লেসের পাশাপাশি বিভিন্ন প্রতিষ্ঠানে ওয়েব ডেভেলপমেন্ট কাজের চাহিদা দিন দিন বেড়েই চলছে। এর ফলে বিশ্বজুড়ে ওয়েব ডেভেলপারদের চাহিদা রয়েছে বেশ। ভবিষ্যতেও এ কাজের চাহিদা বৃদ্ধি পাবে বলে আশা করা যায়। আর তাই অনেক তরুণ-তরুণীই ওয়েব ডেভেলপমেন্টকে ক্যারিয়ার হিসেবে বেছে নিতে আগ্রহী। কিন্তু শুরুটা কীভাবে করতে হবে বা কী কী বিষয়ে দক্ষতা অর্জন করতে হবে, সে বিষয়ে ভালো ধারণা না থাকায় অনেকেই ওয়েব ডেভেলপার হিসেবে নিজেকে প্রতিষ্ঠিত করতে পারেন না। ওয়েব ডেভেলপমেন্টে সফল হতে হলে নিচের বিষয়গুলো সম্পর্কে ভালো ধারণা রাখতে হবে।
        কাজের ধরন

        ওয়েব ডেভেলপমেন্টে সাধারণত ‘ফ্রন্ট এন্ড ডেভেলপার’, ‘ব্যাক এন্ড ডেভেলপার’ ও ‘ফুল-স্ট্যাক ডেভেলপার’ হিসেবে কাজ করার সুযোগ মিলে থাকে। ফ্রন্ট এন্ড ডেভেলপাররা সাধারণত ওয়েবসাইটের দৃশ্যমান স্ট্যাটিক ওয়েব পেজ তৈরি করেন। এটি ওয়েব ডেভেলপমেন্টের প্রথম ধাপ। এ কাজ করার জন্য স্ট্যাটিক ওয়েব পেজ তৈরির খুঁটিনাটি সম্পর্কে ভালো ধারণা রাখতে হবে। ব্যাক এন্ড ডেভেলপাররা মূলত স্ট্যাটিক ওয়েব পেজকে ডাইনামিক ওয়েব পেজে রূপান্তরের কাজ করে থাকেন। আর এ দুটি কাজই যাঁরা করেন, তাঁরা মূলত ফুল-স্ট্যাক ডেভেলপার হিসেবে পরিচিত।
        ওয়েব ডেভেলপমেন্টের কাজ শেখা খুব কঠিন নয়। তবে আপনি যেখান থেকেই প্রশিক্ষণ নেন না কেন, পরিশ্রম আপনাকে করতেই হবে। পরিশ্রম না করলে ভালো মানের ওয়েব ডেভেলপার হতে পারবেন না।
        প্রাথমিক বিষয়

        ওয়েব ডেভেলপমেন্ট কাজের শুরুতেই আপনাকে ফ্রন্ট এন্ড ডেভেলপমেন্টের মূল কাজগুলো জানতে হবে। এ জন্য এইচটিএমএল এবং সিএসএস সম্পর্কে বিস্তারিত ধারণা থাকা বেশ জরুরি। এ ছাড়া ওয়েব পেজের কাঠামো কীভাবে ফ্রেম করতে হয়, তা–ও জানতে হবে। এসব বিষয় শিখে ফেলতে মোটামুটি এক সপ্তাহের প্রয়োজন হবে।
        কাজের ধরন নির্বাচন

        ওয়েব ডেভেলপমেন্টের প্রাথমিক বিষয় জানার পর আপনাকে ঠিক করতে হবে, আপনি কোন ধরনের কাজ করবেন। অর্থাৎ, শুরুতেই সিদ্ধান্ত নিতে হবে, আপনি ইন্টারফেস ডিজাইনের সঙ্গে জড়িত থাকতে চান নাকি ব্যাক এন্ডে কাজ করতে চান। ফ্রন্ট এন্ড ডেভেলপার হিসেবে কাজ করা তুলনামূলক সহজ, তবে আপনাকে অবশ্যই ব্যবহারকারীর প্রয়োজন ও চাহিদা সম্পর্কে জানতে হবে। আবার আপনি যদি ব্যাক এন্ড ডেভেলপার হিসেবে কাজ করতে চান, তবে ব্যাক এন্ড সার্ভার ও স্ক্রিপ্টের পাশাপাশি বিভিন্ন সেবা সম্পর্কে জানতে হবে। আর আপনি যদি ফুল–স্ট্যাক ডেভেলপার হিসেবে কাজ করতে চান, তবে অবশ্যই ফ্রন্ট এন্ড এবং ব্যাক এন্ড ডেভেলপারের সব কাজ ভালোভাবে করার দক্ষতা অর্জন করতে হবে।
        ভাষা নির্বাচন

        ওয়েব ডেভেলপমেন্ট কাজের জন্য সবচেয়ে বেশি ব্যবহার হওয়া প্রোগ্রামিং ভাষার মধ্যে সিএসএস, এইচটিএমএল ও জাভাস্ক্রিপ্ট অন্যতম। এ ছাড়া পাইথন, পিএইচপি, রুবি, সি++, শিফট, কটলিন ভাষাগুলোও ভিন্ন ভিন্ন কাজে ব্যবহৃত হয়ে থাকে। তবে ওয়েব ডেভেলপমেন্ট কাজের শুরুতে সিএসএস, এইচটিএমএল ও জাভাস্ক্রিপ্ট বিষয়ে আপনাকে দক্ষ হতে হবে। অন্য ভাষাগুলোও চাইলে শিখতে পারেন। যেমন ব্যাক এন্ডে ডেটাবেজ নিয়ে কাজ করতে চাইলে অবশ্যই এসকিউএল ভাষা জানতে হবে।
        ওয়েব ডেভেলপমেন্ট শেখার পদ্ধতি

        ওয়েব ডেভেলপমেন্ট শিখতে অনেকেই প্রশিক্ষণকেন্দ্রের খোঁজ করেন। তবে শুরুতেই কোথাও যাওয়ার প্রয়োজন নেই। অনলাইন থেকে আগে বেসিক বিষয়গুলো আয়ত্ত করতে হবে। চাইলে বিভিন্ন প্রতিষ্ঠান থেকেও প্রশিক্ষণ নিতে পারেন। মনে রাখতে হবে, আপনি যেখান থেকেই প্রশিক্ষণ গ্রহণ করেন না কেন, দক্ষতা অর্জন করতে না পারলে ওয়েব ডেভেলপমেন্ট কাজে সফল হতে পারবেন না। তাই ভালোমতো শিখে তবেই ওয়েব ডেভেলপমেন্টে ক্যারিয়ার শুরু করা উচিত।`,
        image: 'https://i.ibb.co/VMMMFvJ/12345.jpg',
        priceName: 'Course fee',
        curenci:'BD',
        Price: 15000  
        },

        {
        CourseName: 'Graphics Design',
        detail:`ফ্রিল্যান্সিং সেক্টরে গ্রাফিক ডিজাইন শিখার প্রতি আগ্রহটা একটু বেশি দেখা যায়। অনলাইনে সুযোগও রয়েছে অনেক। ভাল মানের ডিজাইনারদের চাহিদা মার্কেটপ্লেসগুলোতে অনেক বেশি। কাজ শেখার পর অনেকদিন প্রাকটিস করার পর যে কেউ ভালমানের ডিজাইনার হতে পারে। ডিজাইনার হয়ে কেউ জন্মায় না। অনেক প্রাকটিস যে কাউকে ডিজাইনার বানাতে পারে।
        ধাপঃ ১

        অনলাইনে বিভিন্ন টিউটোরিয়ালগুলো খুজে বের করুন, সেগুলো পড়ুন কিংবা ভিডিও হলে দেখুন।
        
        ইউটিউবে সার্চ করে ভাল ভিডিও সোর্স খুজে বের করতে পারবেন।
        
        দেখে দেখে ৫টি প্রজেক্ট করুন এবং আপনার দক্ষতাকে আরও বৃদ্ধি করতে পারেন।
        
        ধাপঃ ২
        অনেক কিছু শিখতে হবে। যদি আপনার কম্পিউটার সম্পর্কে প্রাথমিক কিছু জ্ঞান থেকে থাকে, তাহলে ইতিমধ্যে হয়ত অনেক কিছুই আপনার জানা আছে।

        কি কি শিখতে হবে, তার কিছু এখানে উল্লেখ করছি।


        – স্ক্যালিং: আপনার ইচ্ছেমত ছবিকে বড় এবং ছোট করা জানতে হবে।

        – নির্দিষ্ট এলাকাকে কালার, টেক্সচার দিয়ে ফিল আপ করা শিখতে হবে।

        – ছবির কালার এবং অন্য ধরনের কিছু পরিবর্তন করা শিখুন।

        – বিভিন্ন কাজের জন্য ভিন্ন ভিন্ন ফরম্যাটে ছবিকে সংরক্ষণ করুন।

        – ছবির একটি নির্দিষ্ট অংশকে ডিলিট করা কিংবা ব্যাকগ্রাউন্ড রিমুভ করা শিখুন।

        – ছবিকে ক্রপ (crop) করা, আউটলাইন, এডজ ডিটেকশন করুন।

        – কপি ও পেস্ট, ড্র্যাগ ও ড্রপ, ডুপলিকেট করা শিখুন।
        – ছবিকে ফ্লিপ (Flip) করা, বিভিন্ন অ্যাংগেলে রোটেট করা (rotate) করা
        – মুভ (move), নাডজ (Nudge) এর বিষয় জানতে হবে।
        – নতুন লেয়ার তৈরি এবং লেয়ারের বিভিন্ন ইফেক্ট জানা থাকতে হবে।
        – প্রয়োজন অনুযায়ি কালার ব্যবহার করা জানা জরুরী
        – গ্রে স্ক্যাল (gray scale) কিংবা ছবিকে সাদাকালো কিংবা ছবিকে নেগেটিভ করা জানতে হবে।
        – টেক্সচার, শ্যাডো এবং অন্যান্য স্পেশাল ইফেক্ট (পোস্টারাইজ (Posterize), পিক্সেলাইজ (Pixelize), অ্যামবুস( Emboss), ব্লার (Blur), শার্পেন ৯ Sharpen) ইত্যাদি ব্যাপারে জানা থাকতে হবে।
        – বর্ডার (Borders) তৈরি, স্ক্যাল ব্যবহার।
        – ব্যাকগ্রাউন্ড (Background), ফরগ্রাউন্ড (foreground) সম্পর্কে ধারণা
        – আইকন এবং লোগো তৈরি
        – পেজ লেআউট তৈরি, কলাম তৈরি করা শিখতে হবে।
        – লেখার সাইজ পরিবর্তন, বোল্ড, ইটালিক ইত্যাদি করা জানতে হবে।
        ধাপঃ৩
        নিজের ব্যক্তিগত কিংবা আশেপাশের অন্যদের প্রফেশনাল কাজগুলো ফ্রি করে দিন। অনেকগুলো রিয়েল প্রজেক্ট করলে মোটামুটি কনফিডেন্ট তৈরি হবে।
        ধাপঃ৪
        ধাপঃ২ এবং ধাপঃ ৩ এর পর আপনি মোটমুটি কাজ শিখে গেছেন। এবার আপনাকে কনটেস্টে অংশগ্রহন করতে হবে। যদিও কনটেস্টে জয় লাভ করা কষ্টকর। কিন্তু আপনি শুধু জেতার জন্য কনটেস্টে অংশগ্রহণ করবেননা। প্রতিযোগিতার বাজার দেখে নিজেকে আরও দক্ষ করা এবং নিজের দক্ষতাকে সবার সামনে প্রকাশ করার জন্য অনলাইনে বিভিন্ন কনটেস্টে অংশগ্রহণ করুন।`,
        image: 'https://i.ibb.co/Ksj140t/123.jpg',
        priceName: 'Course fee',
        curenci:'BD',
        Price: 5000  
        }
      ]
    return (
        <>
            <h1 className='text-center'>Popular Course</h1>
            <p style={{textAlign:'center'}}>We have designed our courses with the most demanding professional skills. The knowledge, experience, and expertise gained through the program will ensure your desired job in the global market. From the list below you can enroll to any online or offline courses at any time.</p>

        <div className='CourseDetails'>
            {
                AddCourse.map(pd=><Course course={pd}key={pd.name}></Course>)
            }
            
        </div>
        </>
    );
};

export default Aboute;